# Module: Pandas Assignments
## Lesson: Pandas

### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [2]:
import pandas as pd
import numpy as np

In [3]:
a = np.random.randint(1 , 100, 6)
b = np.random.randint(1 , 100, 6)
c = np.random.randint(1 , 100, 6)
d = np.random.randint(1 , 100, 6)

df = pd.DataFrame({'A':a, 'B':b, 'C':c, 'D':d}, index = a)
print(df)

     A   B   C   D
82  82  82  86  25
87  87  75  39  63
67  67  53  87   5
70  70  10  87  33
17  17  92  87  62
4    4  33  45  16

In [7]:
index = ['X', 'Y', 'Z']
A = np.random.randint(1 , 100, 3)
B = np.random.randint(1 , 100, 3)
C = np.random.randint(1 , 100, 3)

df2 = pd.DataFrame({'A':A, 'B':B, 'C':C}, index = index)
print(df2)

    A   B   C
X  22  27  89
Y  91  77  80
Z  58  22  38

In [8]:
print(df2['B']['Y'])

77


### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.
2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [12]:
numbers = np.random.randint(1, 100, (5 , 3))
df3 = pd.DataFrame(numbers, columns=['A', 'B', 'C'])

print(df3)

    A   B   C
0  16  74  71
1  15  88  15
2  19  34   1
3  58  42  12
4  85  59  87

In [13]:
df3['D'] = df3['A'] + df3['B']
print(df3)

    A   B   C    D
0  16  74  71   90
1  15  88  15  103
2  19  34   1   53
3  58  42  12  100
4  85  59  87  144

In [14]:
numbers = np.random.randint(1 , 100, ( 4 , 3))
df4 = pd.DataFrame(numbers, columns=['A', 'B', 'C'])

print(df4)

    A   B   C
0   2  74  88
1  81  53  89
2  80  46  96
3  77  50  18

In [15]:
columns_sum = df4.sum()
print(columns_sum)

A    240
B    223
C    291
dtype: int64

In [16]:
row_sum = df4.sum(axis=1)
print(row_sum)

0    164
1    223
2    222
3    145
dtype: int64


### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.
2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [26]:
numbers = np.random.randint(1, 100, (5 , 3))
df3 = pd.DataFrame(numbers, columns=['A', 'B', 'C'])

print(df3)

    A   B   C
0  10  63  32
1  34   5  94
2  18  93  36
3  70  53  99
4   6  78  81

In [27]:
df3.iloc[2 , 0] = np.nan
df3.iloc[0 , 2] = np.nan
df3.iloc[ 3, 1] = np.nan

print(df3)

      A     B     C
0  10.0  63.0   NaN
1  34.0   5.0  94.0
2   NaN  93.0  36.0
3  70.0   NaN  99.0
4   6.0  78.0  81.0

In [28]:
df3.fillna(value = df3.mean(), inplace=True)
print(df3)

      A      B     C
0  10.0  63.00  77.5
1  34.0   5.00  94.0
2  30.0  93.00  36.0
3  70.0  59.75  99.0
4   6.0  78.00  81.0


### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.
2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [30]:
categories = np.random.choice(['A', 'B', 'C'], 100)
values = np.random.randint(1, 100, 100)

df5 = pd.DataFrame({'Category': categories, 'Value': values})

df5

   Category  Value
0         C     61
1         B     55
2         B     30
3         B     39
4         A     34
..      ...    ...
95        B     45
96        B     22
97        B     16
98        A     70
99        B     50

[100 rows x 2 columns]

In [31]:
df5.groupby('Category')['Value'].mean()

Category
A    54.090909
B    42.000000
C    52.028571
Name: Value, dtype: float64

In [32]:
df5.groupby('Category')['Value'].sum()

Category
A    1785
B    1344
C    1821
Name: Value, dtype: int64

In [33]:
products = np.random.choice(['X' , 'Y', 'Z'] , 100)
categoreis = np.random.choice(['A', 'B', 'C'], 100)
values = np.random.randint(1, 100, 100)

df6 = pd.DataFrame({'Product': products, 'Category': categoreis, 'Value': values})
df6

   Product Category  Value
0        X        B     10
1        Y        A      1
2        Y        B     42
3        Z        B     98
4        Z        A     80
..     ...      ...    ...
95       X        B     11
96       Z        A     16
97       Y        C     71
98       Z        C     43
99       X        B     94

[100 rows x 3 columns]

In [34]:
df6.groupby(['Product', 'Category'])['Value'].sum()

Product  Category
X        A           445
         B           727
         C           570
Y        A           722
         B           347
         C           225
Z        A           568
         B           730
         C           713
Name: Value, dtype: int64


### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.
2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

In [38]:
a = np.random.randint(1 , 100, 6)
b = np.random.randint(1 , 100, 6)
c = np.random.randint(1 , 100, 6)

df1 = pd.DataFrame({'A': a, 'B': b})
df2 = pd.DataFrame({'B': b, 'C': c})

df1.head()

    A   B
0  16  13
1  66  11
2  72  59
3  44  63
4  91   4

In [37]:
df2.head()

    B   C
0  87   6
1  23  62
2  56  82
3  54  74
4  56  63

In [39]:
df_merged = pd.merge(df1, df2, on='B')
df_merged

    A   B   C
0  16  13  29
1  66  11   1
2  72  59  67
3  44  63  86
4  91   4  29
5  15  90  52

In [41]:

pd.concat([df1, df2], axis=0)

      A   B     C
0  16.0  13   NaN
1  66.0  11   NaN
2  72.0  59   NaN
3  44.0  63   NaN
4  91.0   4   NaN
5  15.0  90   NaN
0   NaN  13  29.0
1   NaN  11   1.0
2   NaN  59  67.0
3   NaN  63  86.0
4   NaN   4  29.0
5   NaN  90  52.0

In [42]:
pd.concat([df1, df2], axis=1)

    A   B   B   C
0  16  13  13  29
1  66  11  11   1
2  72  59  59  67
3  44  63  63  86
4  91   4   4  29
5  15  90  90  52


### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.
2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

In [43]:
numbers = np.random.randint(1 , 100, 100)
dates = pd.date_range('20230101', periods=100)
df7 = pd.DataFrame({'Date': dates, 'Value': numbers}, index = dates)
df7

                 Date  Value
2023-01-01 2023-01-01     54
2023-01-02 2023-01-02     94
2023-01-03 2023-01-03     32
2023-01-04 2023-01-04     92
2023-01-05 2023-01-05     76
...               ...    ...
2023-04-06 2023-04-06     78
2023-04-07 2023-04-07     85
2023-04-08 2023-04-08     73
2023-04-09 2023-04-09     14
2023-04-10 2023-04-10     28

[100 rows x 2 columns]

In [44]:
df7.resample('M').mean()

/tmp/ipykernel_2118/1418417766.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df7.resample('M').mean()

                          Date      Value
2023-01-31 2023-01-16 00:00:00  52.387097
2023-02-28 2023-02-14 12:00:00  38.428571
2023-03-31 2023-03-16 00:00:00  50.903226
2023-04-30 2023-04-05 12:00:00  56.500000

In [47]:
dates = pd.date_range(start = '20210101', end = '20211231', freq='D')
numbers = np.random.randint(1 , 100, len(dates))

df8 = pd.DataFrame({'Value': numbers}, index = dates)
df8

            Value
2021-01-01     24
2021-01-02     42
2021-01-03     11
2021-01-04     61
2021-01-05     56
...           ...
2021-12-27     61
2021-12-28     70
2021-12-29     21
2021-12-30     75
2021-12-31     13

[365 rows x 1 columns]

In [ ]:
df8.rolling(7).mean()

                Value
2021-01-01        NaN
2021-01-02        NaN
2021-01-03        NaN
2021-01-04        NaN
2021-01-05        NaN
...               ...
2021-12-27  48.571429
2021-12-28  55.285714
2021-12-29  56.000000
2021-12-30  62.857143
2021-12-31  53.142857

[365 rows x 1 columns]


### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.
2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

In [50]:
# Create a MultiIndex DataFrame
arrays = [
    ['A', 'A', 'A', 'B', 'B', 'B'],
    ['one', 'two', 'three', 'one', 'two', 'three']
]
index = pd.MultiIndex.from_tuples(list(zip(*arrays)), names=['Category', 'SubCategory'])
data = np.random.randint(1, 100, (6, 2))
df_multi = pd.DataFrame(data, index=index, columns=['Value1', 'Value2'])

# Basic indexing and slicing
print(df_multi.loc['A'])
print(df_multi.loc[('B', 'two')])
print(df_multi.xs('one', level='SubCategory'))

# Sum of values for each 'Category' and 'SubCategory'
df_sum = df_multi.groupby(['Category', 'SubCategory']).sum()
print(df_sum)

             Value1  Value2
SubCategory
one              81      40
two              16      59
three            56      76
Value1    15
Value2    73
Name: (B, two), dtype: int64
          Value1  Value2
Category
A             81      40
B             59      91
                      Value1  Value2
Category SubCategory
A        one              81      40
         three            56      76
         two              16      59
B        one              59      91
         three            72      14
         two              15      73


### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.
2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

In [51]:
# Assignment 8: Pivot Tables

# 1. Create a DataFrame with columns 'Date', 'Category', and 'Value'
dates = pd.date_range('2023-01-01', periods=20)
categories_sample = np.random.choice(['A', 'B', 'C'], 20)
values_sample = np.random.randint(1, 100, 20)
df_pivot = pd.DataFrame({'Date': dates, 'Category': categories_sample, 'Value': values_sample})

# Pivot table: sum of 'Value' for each 'Category' by 'Date'
pivot_table1 = pd.pivot_table(df_pivot, values='Value', index='Date', columns='Category', aggfunc='sum')
print(pivot_table1)

# 2. DataFrame with 'Year', 'Quarter', and 'Revenue'
years = np.random.choice([2021, 2022, 2023], 12)
quarters = np.tile(['Q1', 'Q2', 'Q3', 'Q4'], 3)
revenues = np.random.randint(1000, 10000, 12)
df_revenue = pd.DataFrame({'Year': years, 'Quarter': quarters, 'Revenue': revenues})

# Pivot table: mean 'Revenue' for each 'Quarter' by 'Year'
pivot_table2 = pd.pivot_table(df_revenue, values='Revenue', index='Year', columns='Quarter', aggfunc='mean')
print(pivot_table2)

Category       A     B     C
Date
2023-01-01  22.0   NaN   NaN
2023-01-02  95.0   NaN   NaN
2023-01-03   NaN   NaN  21.0
2023-01-04   NaN   NaN  38.0
2023-01-05  19.0   NaN   NaN
2023-01-06  35.0   NaN   NaN
2023-01-07   NaN  62.0   NaN
2023-01-08   NaN   NaN   1.0
2023-01-09   NaN   4.0   NaN
2023-01-10   NaN  84.0   NaN
2023-01-11   NaN   NaN  39.0
2023-01-12  66.0   NaN   NaN
2023-01-13   NaN   3.0   NaN
2023-01-14   NaN   NaN   8.0
2023-01-15   NaN  95.0   NaN
2023-01-16   NaN   NaN  90.0
2023-01-17   NaN  16.0   NaN
2023-01-18   NaN  75.0   NaN
2023-01-19   NaN  17.0   NaN
2023-01-20   NaN  63.0   NaN
Quarter      Q1      Q2      Q3      Q4
Year
2021     5175.0  6107.0     NaN  4331.5
2022     5923.0  3020.0  7572.0     NaN
2023        NaN     NaN  6576.0  3562.0


### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.
2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

In [53]:
numbers = np.random.randint(1 , 100, (5 , 3))
df3 = pd.DataFrame(numbers, columns=['A', 'B', 'C'])
df3

    A   B   C
0  10  23  90
1  35  95  41
2  27  16  78
3  28  81  69
4  77  89  62

In [54]:
df3.apply(lambda x: 2*x)

     A    B    C
0   20   46  180
1   70  190   82
2   54   32  156
3   56  162  138
4  154  178  124

In [55]:
numbers = np.random.randint(1 , 100, (6 , 3))
df4 = pd.DataFrame(numbers, columns=['A', 'B', 'C'])
df4

    A   B   C
0  81   2  74
1  54  74   8
2  45  58  78
3  52  66  22
4  94  83  59
5  80  36   4

In [60]:
df4['sum'] = df4.apply(lambda x: x['A'] + x['B'] + x['C'], axis=1)
df4

    A   B   C    sum
0  81   2  74  157.0
1  54  74   8  136.0
2  45  58  78  181.0
3  52  66  22  140.0
4  94  83  59  236.0
5  80  36   4  120.0


### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.
2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

In [5]:
import string

# Generate 5 random text strings, each of length 6
random_strings = [''.join(np.random.choice(list(string.ascii_letters), 6)) for _ in range(5)]
x = pd.Series(random_strings)
x

0    cEDRDV
1    zrRfxm
2    wbtwLZ
3    gGrfSg
4    ljdMYg
dtype: object

In [6]:
x.str.upper()

0    CEDRDV
1    ZRRFXM
2    WBTWLZ
3    GGRFSG
4    LJDMYG
dtype: object

In [8]:
x.str[:3]

0    cED
1    zrR
2    wbt
3    gGr
4    ljd
dtype: object